Amiya200/stm32_water_tank/Core/Src/model_handle.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  FINAL MODEL HANDLE – FULLY UPDATED (2025)
 *  Supports:
 *    - Timer (5 Slots) with DayMask + Enabled
 *    - Semi-Auto, Auto, Countdown, Twist, Manual
 *    - Soft Dry-Run FSM
 *    - DS1307 DOW (1–7 → Mon–Sun)
 ***************************************************************/

#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"
#include "eeprom_i2c.h"
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/***************************************************************
 *  EXTERNAL MODULE VARIABLES
 ***************************************************************/
extern ADC_Data adcData;
extern RTC_Time_t time;
TimerSlot timerSlots[5] = {0};

/***************************************************************
 *  GLOBAL MODE FLAGS
 ***************************************************************/
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;

/***************************************************************
 *  MOTOR STATUS (0 = OFF, 1 = ON)
 ***************************************************************/
volatile uint8_t motorStatus = 0;

/***************************************************************
 *  SAFETY FLAGS
 ***************************************************************/
volatile bool senseDryRun         = false;   // TRUE = WATER PRESENT
volatile bool senseOverLoad       = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;
// USER CONFIGURABLE SETTINGS (persistent)
static uint16_t user_gap_s        = 10;     // Default
static uint8_t  user_retry_count  = 3;
static uint16_t user_uv_limit     = 0;
static uint16_t user_ov_limit     = 260;
static float    user_overload     = 20.5f;
static float    user_underload    = 0.0f;
static uint16_t user_maxrun_min   = 120;
volatile bool senseUnderLoad = false;

typedef struct {
    bool manual_on;
    bool semi_on;
    bool timer_on;
    bool countdown_on;
    bool twist_on;
    bool auto_on;
    bool motor_on;
} ModeState;
ModeState modeState;

SystemSettings sys = {
    .gap_time_s = 10,
    .retry_count = 3,
    .uv_limit = 180,
    .ov_limit = 260,
    .overload = 6.5f,
    .underload = 0.5f,
    .maxrun_min = 120
};

extern HAL_StatusTypeDef EEPROM_WriteBytes(uint16_t addr, uint8_t *data, uint16_t len);
extern HAL_StatusTypeDef EEPROM_ReadBytes(uint16_t addr, uint8_t *data, uint16_t len);

uint16_t sys_gap_time_s;
uint8_t  sys_retry_count;

uint16_t sys_uv_limit;
uint16_t sys_ov_limit;
extern float g_currentA;
extern float g_voltageV;

float sys_overload_limit;
float sys_underload_limit;

uint16_t sys_maxrun_min;
void ModelHandle_SaveSettingsToEEPROM(void)
{
    EEPROM_WriteBuffer(EE_ADDR_GAP_TIME,       (uint8_t*)&sys.gap_time_s,    sizeof(sys.gap_time_s));
    EEPROM_WriteBuffer(EE_ADDR_RETRY_COUNT,    (uint8_t*)&sys.retry_count,   sizeof(sys.retry_count));
    EEPROM_WriteBuffer(EE_ADDR_UV_LIMIT,       (uint8_t*)&sys.uv_limit,      sizeof(sys.uv_limit));
    EEPROM_WriteBuffer(EE_ADDR_OV_LIMIT,       (uint8_t*)&sys.ov_limit,      sizeof(sys.ov_limit));
    EEPROM_WriteBuffer(EE_ADDR_OVERLOAD,       (uint8_t*)&sys.overload,      sizeof(sys.overload));
    EEPROM_WriteBuffer(EE_ADDR_UNDERLOAD,      (uint8_t*)&sys.underload,     sizeof(sys.underload));
    EEPROM_WriteBuffer(EE_ADDR_MAXRUN,         (uint8_t*)&sys.maxrun_min,    sizeof(sys.maxrun_min));

    uint16_t sig = SETTINGS_SIGNATURE;
    EEPROM_WriteBuffer(EE_ADDR_SIGNATURE, (uint8_t*)&sig, sizeof(sig));
}
void ModelHandle_LoadModeState(void)
{
    EEPROM_ReadBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));

    manualActive    = modeState.manual_on;
    semiAutoActive  = modeState.semi_on;
    timerActive     = modeState.timer_on;
    countdownActive = modeState.countdown_on;
    twistActive     = modeState.twist_on;
    autoActive      = modeState.auto_on;

    if (modeState.motor_on)
        ModelHandle_SetMotor(true);
}

void ModelHandle_LoadSettingsFromEEPROM(void)
{
    uint16_t sig = 0;
    EEPROM_ReadBuffer(EE_ADDR_SIGNATURE, (uint8_t*)&sig, sizeof(sig));

    if (sig != SETTINGS_SIGNATURE)
    {
        // First boot → save defaults
        ModelHandle_SaveSettingsToEEPROM();
        return;
    }

    EEPROM_ReadBuffer(EE_ADDR_GAP_TIME,    (uint8_t*)&sys.gap_time_s,    sizeof(sys.gap_time_s));
    EEPROM_ReadBuffer(EE_ADDR_RETRY_COUNT, (uint8_t*)&sys.retry_count,   sizeof(sys.retry_count));
    EEPROM_ReadBuffer(EE_ADDR_UV_LIMIT,    (uint8_t*)&sys.uv_limit,      sizeof(sys.uv_limit));
    EEPROM_ReadBuffer(EE_ADDR_OV_LIMIT,    (uint8_t*)&sys.ov_limit,      sizeof(sys.ov_limit));
    EEPROM_ReadBuffer(EE_ADDR_OVERLOAD,    (uint8_t*)&sys.overload,      sizeof(sys.overload));
    EEPROM_ReadBuffer(EE_ADDR_UNDERLOAD,   (uint8_t*)&sys.underload,     sizeof(sys.underload));
    EEPROM_ReadBuffer(EE_ADDR_MAXRUN,      (uint8_t*)&sys.maxrun_min,    sizeof(sys.maxrun_min));
}
void ModelHandle_SaveModeState(void)
{
    modeState.manual_on    = manualActive;
    modeState.semi_on      = semiAutoActive;
    modeState.timer_on     = timerActive;
    modeState.countdown_on = countdownActive;
    modeState.twist_on     = twistActive;
    modeState.auto_on      = autoActive;
    modeState.motor_on     = Motor_GetStatus();

    EEPROM_WriteBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));
}

/***************************************************************
 *  MANUAL OVERRIDE FLAG
 ***************************************************************/
volatile bool manualOverride = false;

/***************************************************************
 *  INTERNAL UTILITY
 ***************************************************************/
static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
uint16_t ModelHandle_GetGapTime(void) {
    return user_gap_s;
}

