Amiya200/stm32_water_tank/Core/Src/model_handle.c
uint8_t ModelHandle_GetRetryCount(void) {
    return user_retry_count;
}

uint16_t ModelHandle_GetUnderVolt(void) {
    return user_uv_limit;
}

uint16_t ModelHandle_GetOverVolt(void) {
    return user_ov_limit;
}

float ModelHandle_GetOverloadLimit(void) {
    return user_overload;
}

float ModelHandle_GetUnderloadLimit(void) {
    return user_underload;
}

uint16_t ModelHandle_GetMaxRunTime(void) {
    return user_maxrun_min;
}
void ModelHandle_SetUserSettings(
    uint16_t gap_s,
    uint8_t retry,
    uint16_t uv,
    uint16_t ov,
    float overload,
    float underload,
    uint16_t maxrun_min
){
    sys.gap_time_s = gap_s;
    sys.retry_count = retry;
    sys.uv_limit = uv;
    sys.ov_limit = ov;
    sys.overload = overload;
    sys.underload = underload;
    sys.maxrun_min = maxrun_min;

    ModelHandle_SaveSettingsToEEPROM();
}

void ModelHandle_FactoryReset(void)
{
    user_gap_s       = 10;
    user_retry_count = 3;
    user_uv_limit    = 180;
    user_ov_limit    = 260;
    user_overload    = 6.5f;
    user_underload   = 0.5f;
    user_maxrun_min  = 120;

    // Optional: EEPROM_SaveDefaults();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
}

/***************************************************************
 *  MOTOR CONTROL (ANTI-CHATTER)
 ***************************************************************/

static inline void motor_apply(bool on)
{
    if (on == Motor_GetStatus())
        return;

    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;

    UART_SendStatusPacket();
}

static inline void start_motor(void) { motor_apply(true); }
static inline void stop_motor(void)  { motor_apply(false); }

bool Motor_GetStatus(void)
{
    return (motorStatus == 1);
}

/***************************************************************
 *  MANUAL MODE CONTROL
 ***************************************************************/
void ModelHandle_SetMotor(bool on)
{
    clear_all_modes();
    manualOverride = true;

    /* In manual mode dry-run is disabled */
    senseDryRun = false;

    if (on) start_motor();
    else    stop_motor();
}

/* RESET pump logic (SW1 short press) */
void reset(void)
{
    if (Motor_GetStatus())
    {
        stop_motor();
        HAL_Delay(2000);
        start_motor();
    }
    else
    {
        start_motor();
        HAL_Delay(2000);
        stop_motor();
    }
}
static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;

#define DRY_PROBE_ON_MS      5000UL
#define DRY_PROBE_OFF_MS    10000UL
#define DRY_CONFIRM_MS       1500UL

static inline bool isAnyModeActive(void)
{
    return (manualActive ||
            semiAutoActive ||
            countdownActive ||
            twistActive ||
            timerActive ||
            autoActive);
}

/***************************************************************
 *  OVERLOAD + UNDERLOAD CHECK FUNCTION (Modes stay active)
 ***************************************************************/
static uint32_t faultLockTimestamp = 0;
static bool faultLocked = false;

#define LOAD_FAULT_CONFIRM_MS     3000   // confirm overload/underload for 3 seconds
#define LOAD_RETRY_RUN_MS         3000   // run motor for 3 seconds during retry
#define LOAD_LOCK_DURATION_MS     (1UL * 60UL * 1000UL)   // 30 minutes

typedef enum {
    LOAD_NORMAL = 0,
    LOAD_FAULT_WAIT,
    LOAD_FAULT_LOCK,
    LOAD_RETRY_RUN
} LoadFaultState;

static LoadFaultState loadState = LOAD_NORMAL;
static uint32_t loadTimer = 0;


void ModelHandle_CheckLoadFault(void)
{
    float I = g_currentA;
    float V = g_voltageV;

    float ol = ModelHandle_GetOverloadLimit();
    float ul = ModelHandle_GetUnderloadLimit();
    uint16_t uv = ModelHandle_GetUnderVolt();
    uint16_t ov = ModelHandle_GetOverVolt();

    uint32_t now = HAL_GetTick();

    bool overload  = (I > ol);
    bool underload = (I < ul);
    bool voltFault = (V < uv || V > ov);
    bool loadFault = (overload || underload);

    /***********************************************************
     * LED INDICATION PRIORITY LOGIC
     ***********************************************************/
    if (voltFault)
    {
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 250);
    }
    else if (loadFault)
    {
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 250);
    }
    else
    {
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_OFF, 0); // Ensure blue off
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_OFF, 0); // Ensure purple off
    }

    /***********************************************************
     * LOAD + VOLTAGE PROTECTION — USE SAME FSM
     ***********************************************************/
    bool fault = loadFault || voltFault;

    switch (loadState)
    {
        case LOAD_NORMAL:
            if (fault && Motor_GetStatus())
            {
                loadState = LOAD_FAULT_WAIT;
                loadTimer = now;
            }
            break;

        case LOAD_FAULT_WAIT:
            if (!fault)
            {
                loadState = LOAD_NORMAL;
                break;
            }
            if (now - loadTimer >= LOAD_FAULT_CONFIRM_MS)
            {
                stop_motor();
                loadState = LOAD_FAULT_LOCK;
                loadTimer = now;
            }
            break;

        case LOAD_FAULT_LOCK:
            if (now - loadTimer >= LOAD_LOCK_DURATION_MS)
            {
                if (isAnyModeActive())
                {
                    start_motor();
                    loadState = LOAD_RETRY_RUN;
                    loadTimer = now;
                }
            }
            break;

        case LOAD_RETRY_RUN:
            if (now - loadTimer >= LOAD_RETRY_RUN_MS)
            {
                if (fault)
                {
                    stop_motor();
                    loadState = LOAD_FAULT_LOCK;
                    loadTimer = now;
                }
                else
                {
                    loadState = LOAD_NORMAL;
                }
            }
            break;
    }
}


/***************************************************************
 *  TANK FULL DETECTION
 *  (5 ADC probes = level sensors)
 ***************************************************************/

