Amiya200/stm32_water_tank/Core/Src/model_handle.c
    RTC_GetTimeDate();

    uint16_t nowHM = time.hour * 60 + time.min;

    uint16_t bestDiff = 20000;
    int best = -1;

    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled) continue;

        uint8_t todayMask = get_today_mask();
        if (!(t->dayMask & todayMask)) continue;

        uint16_t onHM = t->onHour * 60 + t->onMinute;
        uint16_t diff = (onHM >= nowHM) ? (onHM - nowHM)
                                        : (1440 - (nowHM - onHM));

        if (diff < bestDiff)
        {
            bestDiff = diff;
            best = i;
        }
    }

    /* Apply */
    ModelHandle_SaveModeState();
    ModelHandle_ProcessTimerSlots();
}

/***************************************************************
 * MAIN TIMER PROCESSOR (called every loop)
 ***************************************************************/
void ModelHandle_ProcessTimerSlots(void)
{
    if (!timerActive)
        return;

    senseDryRun = true; /* ignore dry run */

    if (timer_any_active_slot())
        start_motor();
    else
        stop_motor();
}

/***************************************************************
 * Force timer recalculation
 ***************************************************************/
void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive)
        return;

    senseDryRun = true;

    if (timer_any_active_slot())
        start_motor();
    else
        stop_motor();
}

/***************************************************************
 * Start / Stop Timer Mode
 ***************************************************************/
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;
    senseDryRun = true;

    ModelHandle_TimerRecalculateNow();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    stop_motor();
}

/***************************************************************
 * Legacy timer tick (kept minimal)
 ***************************************************************/
static void timer_tick(void)
{
    ModelHandle_ProcessTimerSlots();
}
void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive)
        return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        senseDryRun = true;
        start_motor();
    }
}

/***************************************************************
 * ====================== SEMI-AUTO MODE =======================
 ***************************************************************/
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    ModelHandle_SaveModeState();
    /* Semi-auto ignores dry-run completely */
    senseDryRun = false;

    if (!isTankFull())
        start_motor();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
}

/***************************************************************
 * ======================== AUTO MODE ==========================
 ***************************************************************/

/* Auto settings */
static uint16_t auto_gap_s       = 10;
static uint16_t auto_maxrun_min  = 12;
static uint8_t  auto_retry_limit = 5;
static uint8_t  auto_retry_count = 0;

typedef enum {
    AUTO_IDLE = 0,
    AUTO_ON_WAIT,
    AUTO_DRY_CHECK,
    AUTO_OFF_WAIT
} AutoState;

static AutoState autoState = AUTO_IDLE;
static uint32_t autoDeadline = 0;
static uint32_t autoRunStart = 0;

/* Start AUTO mode */
void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry)
{
    clear_all_modes();

    autoActive = true;
    ModelHandle_SaveModeState();
    auto_gap_s = gap_s;
    auto_maxrun_min = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;

    autoState = AUTO_ON_WAIT;

    start_motor();
    autoRunStart = now_ms();
    autoDeadline = now_ms() + (gap_s * 1000UL);
}

/* Stop AUTO */
void ModelHandle_StopAuto(void)
{
    autoActive = false;
    autoState = AUTO_IDLE;
    auto_retry_count = 0;

    ModelHandle_SaveModeState();
    stop_motor();
}

/***************************************************************
 *  AUTO MODE TICK ENGINE
 ***************************************************************/
static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = now_ms();

    /*************************************************
     * 1) Handle Overload/Underload/Voltage Fault FSM
     *************************************************/
    ModelHandle_CheckLoadFault();

    /* If motor is OFF due to protection lock, auto should stop */
    if (!Motor_GetStatus() && (loadState == LOAD_FAULT_LOCK))
    {
        ModelHandle_StopAuto();
        return;
    }

    /*************************************************
     * 2) Tank full → stop Auto mode
     *************************************************/
    if (isTankFull())
    {
        ModelHandle_StopAuto();
        return;
    }

    /*************************************************
     * 3) Max Run Time protection
     *************************************************/
    if (now - autoRunStart >= (auto_maxrun_min * 60000UL))
    {
        senseMaxRunReached = true;
        ModelHandle_StopAuto();
        return;
    }

    /*************************************************
     * 4) Auto State Machine (DRY RUN ONLY)
     *************************************************/
    switch (autoState)
    {
        case AUTO_ON_WAIT:
            if (now >= autoDeadline)
                autoState = AUTO_DRY_CHECK;
            break;

        case AUTO_DRY_CHECK:
            ModelHandle_CheckDryRun();

            if (!senseDryRun)   // DRY → stop → gap wait
            {
                stop_motor();
                autoState = AUTO_OFF_WAIT;
                autoDeadline = now + (auto_gap_s * 1000UL);
            }
            else                // Water available → continue
            {
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + (auto_gap_s * 1000UL);
            }
            break;

        case AUTO_OFF_WAIT:
            if (now >= autoDeadline)
            {
                auto_retry_count++;

                if (auto_retry_limit != 0 &&
                    auto_retry_count > auto_retry_limit)
                {
                    ModelHandle_StopAuto();
                    return;
                }

                start_motor();
                autoRunStart = now;
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + (auto_gap_s * 1000UL);
            }
            break;

        default:
            break;
    }
}

/***************************************************************
 * ======================== COUNTDOWN MODE ======================
 ***************************************************************/
volatile uint32_t countdownDuration = 0;
static uint32_t cd_deadline = 0;

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownDuration = 0;
    stop_motor();
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    clear_all_modes();

