Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (seconds == 0)
    {
        countdownActive = false;
        countdownDuration = 0;
        return;
    }

    countdownActive = true;
    countdownDuration = seconds;
    ModelHandle_SaveModeState();
    cd_deadline = now_ms() + seconds * 1000UL;

    start_motor();   // countdown ALWAYS forces motor ON
}

/* Update remaining time */
static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();

    /* Tank full → stop immediately */
    if (isTankFull())
    {
        ModelHandle_StopCountdown();
        return;
    }

    if (now < cd_deadline)
    {
        countdownDuration = (cd_deadline - now) / 1000UL;
    }
    else
    {
        countdownDuration = 0;
        ModelHandle_StopCountdown();
        return;
    }
}

/***************************************************************
 * ========================= TWIST MODE =========================
 ***************************************************************/
TwistSettings twistSettings;

static bool     twist_on_phase = false;
static uint32_t twist_deadline = 0;

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();

    if (on_s == 0)  on_s = 1;
    if (off_s == 0) off_s = 1;

    twistSettings.onDurationSeconds  = on_s;
    twistSettings.offDurationSeconds = off_s;

    twistSettings.onHour   = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour  = offH;
    twistSettings.offMinute= offM;

    twistSettings.twistArmed  = true;
    twistSettings.twistActive = false;

    twist_on_phase = true;
    twist_deadline = now_ms() + (on_s * 1000UL);

    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
}

/* Check if twist should start / stop based on RTC clock */
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed)
        return;

    /* Start twist at ON time */
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;

        twist_on_phase = true;
        twist_deadline = now_ms() + twistSettings.onDurationSeconds * 1000UL;

        start_motor();
    }

    /* Stop twist at OFF time */
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}

/* Twist ON/OFF cycling handler */
static void twist_tick(void)
{
    if (!twistActive)
        return;

    if (isTankFull())
    {
        ModelHandle_StopTwist();
        return;
    }

    uint32_t now = now_ms();

    if (now >= twist_deadline)
    {
        if (twist_on_phase)
        {
            twist_on_phase = false;
            stop_motor();
            twist_deadline = now + twistSettings.offDurationSeconds * 1000UL;
        }
        else
        {
            twist_on_phase = true;
            start_motor();
            twist_deadline = now + twistSettings.onDurationSeconds * 1000UL;
        }
    }

    /* Enforce correct state */
    if (twist_on_phase)
        start_motor();
    else
        stop_motor();
}

/***************************************************************
 * ======================== PROTECTIONS =========================
 ***************************************************************/
static void protections_tick(void)
{
    if (senseOverLoad || senseOverUnderVolt)
    {
//        ModelHandle_StopAllModesAndMotor();
    	stop_motor();
        return;
    }
}

/***************************************************************
 * =========================== LEDS =============================
 ***************************************************************/
static void leds_from_model(void)
{
    LED_ClearAllIntents();

    /* Motor ON → GREEN steady */
    if (Motor_GetStatus())
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);

    /* Auto/timer retry (dry-run) → GREEN blink */
    if (!senseDryRun && (autoActive || timerActive))
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);

    /* Pump OFF due to dry-run → RED steady */
    if (!senseDryRun && !Motor_GetStatus())
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);

    /* Max run reached → RED blink */
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);

    /* Overload → BLUE blink */
    if (senseOverLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);

    /* Voltage fault → PURPLE blink */
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);

    LED_ApplyIntents();
}

/***************************************************************
 * ========================== MASTER FSM ========================
 ***************************************************************/
void ModelHandle_Process(void)
{
    /*****************************************************
     * 0. FIRST UPDATE ALL FAULTS (MUST RUN EVERY LOOP)
     *****************************************************/
    ModelHandle_CheckLoadFault();     // Updates: senseOverLoad, senseUnderLoad, senseOverUnderVolt
    protections_tick();               // Global fault killer for all modes
    twist_time_logic();               // Time-based twist ON/OFF control

    /*****************************************************
     * 1. MANUAL MODE (Highest Priority)
     *****************************************************/
    if (manualActive)
    {
        /* Stop motor immediately on ANY critical fault */
        if (senseOverLoad || senseUnderLoad || senseOverUnderVolt)
        {
            stop_motor();
            manualActive   = false;
            manualOverride = false;

            ModelHandle_SaveModeState();
            leds_from_model();
            return;
        }

        /* Manual ignores dry-run & tank full */
        if (!Motor_GetStatus())
            start_motor();

        leds_from_model();
        return;
    }

    /*****************************************************
     * 2. AUTO MODE
     *****************************************************/
    if (autoActive)
    {
        auto_tick();         // Auto FSM
        leds_from_model();   // Update LEDs after state change
        return;
    }

    /*****************************************************
     * 3. SEMI-AUTO MODE
     *****************************************************/
    if (semiAutoActive)
    {
        senseDryRun = false;   // semi-auto ignores dry-run

