Amiya200/stm32_water_tank/Core/Src/model_handle.c
        if (!isTankFull())
        {
            if (!Motor_GetStatus())
                start_motor();
        }
        else
        {
            stop_motor();
            semiAutoActive = false;   // stop semi-auto when tank full
        }

        leds_from_model();
        return;
    }

    /*****************************************************
     * 4. TIMER MODE
     *****************************************************/
    if (timerActive)
    {
        timer_tick();         // Timer ON/OFF based on slots
        leds_from_model();
        return;
    }

    /*****************************************************
     * 5. COUNTDOWN MODE
     *****************************************************/
    if (countdownActive)
    {
        countdown_tick();

        if (isTankFull())
        {
            ModelHandle_StopCountdown();
            leds_from_model();
            return;
        }

        if (!Motor_GetStatus())
            start_motor();     // countdown always forces ON

        leds_from_model();
        return;
    }

    /*****************************************************
     * 6. TWIST MODE
     *****************************************************/
    if (twistActive)
    {
        twist_tick();
        leds_from_model();
        return;
    }

    /*****************************************************
     * 7. IDLE STATE
     *****************************************************/
    stop_motor();
    leds_from_model();
}

/***************************************************************
 * ========================== RESET ALL =========================
 ***************************************************************/
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();

    senseDryRun         = false;
    senseOverLoad       = false;
    senseOverUnderVolt  = false;
    senseMaxRunReached  = false;

    countdownDuration = 0;

    UART_SendStatusPacket();
}

/***************************************************************
 * ===================== AUTO SETTINGS API ======================
 ***************************************************************/
void ModelHandle_SetAutoSettings(uint16_t gap_s, uint16_t maxrun_min, uint8_t retry)
{
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;

    // Optional: save to EEPROM
    EEPROM_WriteBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_WriteBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_WriteBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}
void ModelHandle_LoadAutoSettings()
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}


bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}

/***************************************************************
 * ============= EEPROM STATE SAVE (ONLY MODE FLAG) =============
 ***************************************************************/
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    /* Encode mode */
    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;
    else                      s.mode = 0;

    RTC_SavePersistentState(&s);
}

/***************************************************************
 * ===================== TIMER SLOT SETTER ======================
 ***************************************************************/
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    if (slot >= 5) return;

    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
}

